app/Http/Controllers/Auth/LoginController.php

    public function handleProviderCallback(Request $request, string $provider)
    {
        $providerUser = Socialite::driver($provider)->stateless()->user();

        $user = User::where('email', $providerUser->getEmail())->first();
---
select * from "users" where "email" = 'koichi1110521@gmail.com' limit 1